; domain
(define (domain blocksworld)
    (:requirements :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block) ; observed predicate
        (ontable ?x - block)  ; derived predicate
        (clear ?x - block)  ; derived predicate
        (handempty ?x - robot)  ; derived predicate
        (handfull ?x - robot)  ; derived predicate
        (holding ?x - block) ; derived predicate
    )
    (:action pick_up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put_down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld8)
(:domain blocksworld)
(:objects
    green_block - block 
    arm - robot 
    yellow_block - block 
    orange_block - block 
    purple_block - block 
    pink_block - block 
    red_block - block 
)

(:init
    ( clear red_block )
    ( handempty arm )
    ( on orange_block purple_block )
    ( on pink_block yellow_block )
    ( on purple_block pink_block )
    ( on red_block orange_block )
    ( on yellow_block green_block )
    ( ontable green_block )
)

    (:goal (and (on green_block yellow_block) (on yellow_block pink_block) (on purple_block orange_block) (on orange_block red_block) (clear purple_block) (clear green_block)))
)

; plan
1. (unstack red_block orange_block arm)
   deleted: (clear red_block) (handempty arm) (on red_block orange_block)
   added: (holding red_block) (clear orange_block) (handfull arm)
   goals met: 0 of 6
2. (put_down red_block arm)
   deleted: (holding red_block) (handfull arm)
   added: (clear red_block) (handempty arm) (ontable red_block)
   goals met: 0 of 6
3. (unstack orange_block purple_block arm)
   deleted: (clear orange_block) (handempty arm) (on orange_block purple_block)
   added: (holding orange_block) (clear purple_block) (handfull arm)
   goals met: 1 of 6
4. (stack orange_block red_block arm)
   deleted: (holding orange_block) (clear red_block) (handfull arm)
   added: (clear orange_block) (handempty arm) (on orange_block red_block)
   goals met: 2 of 6
5. (unstack purple_block pink_block arm)
   deleted: (clear purple_block) (handempty arm) (on purple_block pink_block)
   added: (holding purple_block) (clear pink_block) (handfull arm)
   goals met: 1 of 6
6. (stack purple_block orange_block arm)
   deleted: (holding purple_block) (clear orange_block) (handfull arm)
   added: (clear purple_block) (handempty arm) (on purple_block orange_block)
   goals met: 3 of 6
7. (unstack pink_block yellow_block arm)
   deleted: (clear pink_block) (handempty arm) (on pink_block yellow_block)
   added: (holding pink_block) (clear yellow_block) (handfull arm)
   goals met: 3 of 6
8. (put_down pink_block arm)
   deleted: (holding pink_block) (handfull arm)
   added: (clear pink_block) (handempty arm) (ontable pink_block)
   goals met: 3 of 6
9. (unstack yellow_block green_block arm)
   deleted: (clear yellow_block) (handempty arm) (on yellow_block green_block)
   added: (holding yellow_block) (clear green_block) (handfull arm)
   goals met: 4 of 6
10. (stack yellow_block pink_block arm)
   deleted: (holding yellow_block) (clear pink_block) (handfull arm)
   added: (clear yellow_block) (handempty arm) (on yellow_block pink_block)
   goals met: 5 of 6
11. (pick_up green_block arm)
   deleted: (ontable green_block) (clear green_block) (handempty arm)
   added: (handfull arm) (holding green_block)
   goals met: 4 of 6
12. (stack green_block yellow_block arm)
   deleted: (holding green_block) (clear yellow_block) (handfull arm)
   added: (clear green_block) (handempty arm) (on green_block yellow_block)
   goals met: 6 of 6
